pftbest/msp430_svd/msp430-gcc-support-files/targetdb/Modules/msp430/LCD_C_208.0.xml
    <register id="LCDCPCTL1" width="16" offset="0xC" internal="0" description="LCD_C port control 1">
        <bitfield id="LCDS16" description="LCD segment line 16 enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="LCDS16_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS16_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS17" description="LCD segment line 17 enable" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="LCDS17_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS17_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS18" description="LCD segment line 18 enable" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="LCDS18_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS18_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS19" description="LCD segment line 19 enable" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="LCDS19_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS19_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS20" description="LCD segment line 20 enable" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="LCDS20_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS20_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS21" description="LCD segment line 21 enable" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="LCDS21_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS21_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS22" description="LCD segment line 22 enable" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="LCDS22_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS22_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS23" description="LCD segment line 23 enable" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="LCDS23_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS23_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS24" description="LCD segment line 24 enable" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="LCDS24_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS24_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS25" description="LCD segment line 25 enable" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="LCDS25_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS25_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS26" description="LCD segment line 26 enable" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="LCDS26_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS26_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS27" description="LCD segment line 27 enable" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="LCDS27_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS27_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS28" description="LCD segment line 28 enable" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="LCDS28_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS28_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS29" description="LCD segment line 29 enable" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="LCDS29_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS29_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS30" description="LCD segment line 30 enable" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="LCDS30_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS30_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS31" description="LCD segment line 31 enable" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="LCDS31_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS31_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
    </register>
    <register id="LCDCPCTL2" width="16" offset="0xE" internal="0" description="LCD_C port control 2 (256 segments)">
        <bitfield id="LCDS32" description="LCD segment line 32 enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="LCDS32_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS32_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS33" description="LCD segment line 33 enable" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="LCDS33_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS33_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS34" description="LCD segment line 34 enable" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="LCDS34_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS34_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS35" description="LCD segment line 35 enable" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="LCDS35_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS35_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS36" description="LCD segment line 36 enable" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="LCDS36_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS36_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS37" description="LCD segment line 37 enable" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="LCDS37_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS37_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS38" description="LCD segment line 38 enable" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="LCDS38_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS38_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS39" description="LCD segment line 39 enable" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="LCDS39_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS39_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS40" description="LCD segment line 40 enable" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="LCDS40_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS40_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS41" description="LCD segment line 41 enable" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="LCDS41_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS41_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS42" description="LCD segment line 42 enable" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="LCDS42_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS42_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS43" description="LCD segment line 43 enable" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="LCDS43_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS43_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS44" description="LCD segment line 44 enable" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="LCDS44_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS44_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS45" description="LCD segment line 45 enable" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="LCDS45_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS45_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS46" description="LCD segment line 46 enable" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="LCDS46_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS46_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS47" description="LCD segment line 47 enable" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="LCDS47_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS47_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
    </register>
    <register id="LCDCPCTL3" width="16" offset="0x10" internal="0" description="LCD_C port control 3 (384 segments)">
        <bitfield id="LCDS48" description="LCD segment line 48 enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="LCDS48_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS48_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS49" description="LCD segment line 49 enable" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="LCDS49_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS49_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS50" description="LCD segment line 50 enable" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="LCDS50_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS50_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS51" description="LCD segment line 51 enable" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="LCDS51_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS51_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS52" description="LCD segment line 52 enable" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="LCDS52_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS52_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
        <bitfield id="LCDS53" description="LCD segment line 53 enable" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="LCDS53_0" value="0x0" description="Multiplexed pins are port functions"/>
            <bitenum id="LCDS53_1" value="0x1" description="Pins are LCD functions"/>
        </bitfield>
    </register>
