pftbest/msp430_svd/msp430-gcc-support-files/targetdb/Modules/msp430/LCD_C_208.0.xml
    <register id="LCDCCPCTL" width="16" offset="0x12" internal="0" description="LCD_C charge pump control">
        <bitfield id="LCDCPDIS" description="LCD charge pump disable" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="LCDCPCLKSYNC" description="LCD charge pump clock synchronization" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="LCDCPCLKSYNC_0" value="0x0" description="Synchronization disabled"/>
            <bitenum id="LCDCPCLKSYNC_1" value="0x1" description="Synchronization enabled"/>
        </bitfield>
    </register>
    <register id="LCDCIV" width="16" offset="0x1E" internal="0" description="LCD_C interrupt vector">
        <bitfield id="LCDCIV" description="LCD_C interrupt vector value" begin="15" end="0" width="16" rwaccess="R">
            <bitenum id="NONE" value="0x0" description="No interrupt pending"/>
            <bitenum id="LCDNOCAPIFG" value="0x2" description="Interrupt Source: No capacitor connected; Interrupt Flag: LCDNOCAPIFG; Interrupt Priority: Highest"/>
            <bitenum id="LCDBLKOFFIFG" value="0x4" description="Interrupt Source: Blink, segments off; Interrupt Flag: LCDBLKOFFIFG"/>
            <bitenum id="LCDBLKONIFG" value="0x6" description="Interrupt Source: Blink, segments on; Interrupt Flag: LCDBLKONIFG"/>
            <bitenum id="LCDFRMIFG" value="0x8" description="Interrupt Source: Frame interrupt; Interrupt Flag: LCDFRMIFG; Interrupt Priority: Lowest"/>
        </bitfield>
    </register>
    <register id="LCDM1" width="8" offset="0x20" internal="0" description="LCD memory 1">
    </register>
    <register id="LCDM2" width="8" offset="0x21" internal="0" description="LCD memory 2">
    </register>
    <register id="LCDM3" width="8" offset="0x22" internal="0" description="LCD memory 3">
    </register>
    <register id="LCDM4" width="8" offset="0x23" internal="0" description="LCD memory 4">
    </register>
    <register id="LCDM5" width="8" offset="0x24" internal="0" description="LCD memory 5">
    </register>
    <register id="LCDM6" width="8" offset="0x25" internal="0" description="LCD memory 6">
    </register>
    <register id="LCDM7" width="8" offset="0x26" internal="0" description="LCD memory 7">
    </register>
    <register id="LCDM8" width="8" offset="0x27" internal="0" description="LCD memory 8">
    </register>
    <register id="LCDM9" width="8" offset="0x28" internal="0" description="LCD memory 9">
    </register>
    <register id="LCDM10" width="8" offset="0x29" internal="0" description="LCD memory 10">
    </register>
    <register id="LCDM11" width="8" offset="0x2A" internal="0" description="LCD memory 11">
    </register>
    <register id="LCDM12" width="8" offset="0x2B" internal="0" description="LCD memory 12">
    </register>
    <register id="LCDM13" width="8" offset="0x2C" internal="0" description="LCD memory 13">
    </register>
    <register id="LCDM14" width="8" offset="0x2D" internal="0" description="LCD memory 14">
    </register>
    <register id="LCDM15" width="8" offset="0x2E" internal="0" description="LCD memory 15">
    </register>
    <register id="LCDM16" width="8" offset="0x2F" internal="0" description="LCD memory 16">
    </register>
    <register id="LCDM17" width="8" offset="0x30" internal="0" description="LCD memory 17">
    </register>
    <register id="LCDM18" width="8" offset="0x31" internal="0" description="LCD memory 18">
    </register>
    <register id="LCDM19" width="8" offset="0x32" internal="0" description="LCD memory 19">
    </register>
    <register id="LCDM20" width="8" offset="0x33" internal="0" description="LCD memory 20">
    </register>
    <register id="LCDM21" width="8" offset="0x34" internal="0" description="LCD memory 21">
    </register>
    <register id="LCDM22" width="8" offset="0x35" internal="0" description="LCD memory 22">
    </register>
    <register id="LCDM23" width="8" offset="0x36" internal="0" description="LCD memory 23">
    </register>
    <register id="LCDM24" width="8" offset="0x37" internal="0" description="LCD memory 24">
    </register>
    <register id="LCDM25" width="8" offset="0x38" internal="0" description="LCD memory 25">
    </register>
    <register id="LCDM26" width="8" offset="0x39" internal="0" description="LCD memory 26">
    </register>
    <register id="LCDM27" width="8" offset="0x3A" internal="0" description="LCD memory 27">
    </register>
    <register id="LCDM28" width="8" offset="0x3B" internal="0" description="LCD memory 28">
    </register>
    <register id="LCDM29" width="8" offset="0x3C" internal="0" description="LCD memory 29">
    </register>
    <register id="LCDM30" width="8" offset="0x3D" internal="0" description="LCD memory 30">
    </register>
    <register id="LCDM31" width="8" offset="0x3E" internal="0" description="LCD memory 31">
    </register>
    <register id="LCDM32" width="8" offset="0x3F" internal="0" description="LCD memory 32">
    </register>
    <register id="LCDM33_LCDBM1" width="8" offset="0x40" internal="0" description="LCD memory 33 / LCD blinking memory 1">
    </register>
    <register id="LCDM34_LCDBM2" width="8" offset="0x41" internal="0" description="LCD memory 34 / LCD blinking memory 2">
    </register>
    <register id="LCDM35_LCDBM3" width="8" offset="0x42" internal="0" description="LCD memory 35 / LCD blinking memory 3">
    </register>
    <register id="LCDM36_LCDBM4" width="8" offset="0x43" internal="0" description="LCD memory 36 / LCD blinking memory 4">
    </register>
    <register id="LCDM37_LCDBM5" width="8" offset="0x44" internal="0" description="LCD memory 37 / LCD blinking memory 5">
    </register>
    <register id="LCDM38_LCDBM6" width="8" offset="0x45" internal="0" description="LCD memory 38 / LCD blinking memory 6">
    </register>
    <register id="LCDM39_LCDBM7" width="8" offset="0x46" internal="0" description="LCD memory 39 / LCD blinking memory 7">
    </register>
