pftbest/msp430_svd/msp430-gcc-support-files/targetdb/Modules/msp430/LCD_C_208.0.xml
    <register id="LCDM40_LCDBM8" width="8" offset="0x47" internal="0" description="LCD memory 40 / LCD blinking memory 8">
    </register>
    <register id="LCDM41_LCDBM9" width="8" offset="0x48" internal="0" description="LCD memory 41 / LCD blinking memory 9">
    </register>
    <register id="LCDM42_LCDBM10" width="8" offset="0x49" internal="0" description="LCD memory 42 / LCD blinking memory 10">
    </register>
    <register id="LCDM43_LCDBM11" width="8" offset="0x4A" internal="0" description="LCD memory 43 / LCD blinking memory 11">
    </register>
    <register id="LCDM44_LCDBM12" width="8" offset="0x4B" internal="0" description="LCD memory 44 / LCD blinking memory 11">
    </register>
    <register id="LCDM45_LCDBM13" width="8" offset="0x4C" internal="0" description="LCD memory 45 / LCD blinking memory 13">
    </register>
    <register id="LCDM46_LCDBM14" width="8" offset="0x4D" internal="0" description="LCD memory 46 / LCD blinking memory 14">
    </register>
    <register id="LCDM47_LCDBM15" width="8" offset="0x4E" internal="0" description="LCD memory 47 / LCD blinking memory 15">
    </register>
    <register id="LCDM48_LCDBM16" width="8" offset="0x4F" internal="0" description="LCD memory 48 / LCD blinking memory 16">
    </register>
    <register id="LCDM49_LCDBM17" width="8" offset="0x50" internal="0" description="LCD memory 49 / LCD blinking memory 17">
    </register>
    <register id="LCDM50_LCDBM18" width="8" offset="0x51" internal="0" description="LCD memory 50 / LCD blinking memory 18">
    </register>
    <register id="LCDM51_LCDBM19" width="8" offset="0x52" internal="0" description="LCD memory 51 / LCD blinking memory 19">
    </register>
    <register id="LCDM52_LCDBM20" width="8" offset="0x53" internal="0" description="LCD memory 52 / LCD blinking memory 20">
    </register>
</module>
